{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "greeting",
    "1": "goodbye",
    "2": "creator",
    "3": "name",
    "4": "dotnet_work_hours",
    "5": "dot_net_skills",
    "6": "dot_net_salary",
    "7": "dot_net_team_lead_promotion",
    "8": "dot_net_version_in_use",
    "9": "dot_net_source_control",
    "10": "marketing_skills",
    "11": "marketing_salary",
    "12": "marketing_team_lead_promotion",
    "13": "marketing_tools_in_use",
    "14": "marketing_stack_version",
    "15": "web_skills",
    "16": "web_salary",
    "17": "web_team_lead_promotion",
    "18": "location_company",
    "19": "company_events",
    "20": "admission_documents",
    "21": "floors",
    "22": "company_infrastructure",
    "23": "canteen",
    "24": "placement",
    "25": "company_ceo",
    "26": "alternance",
    "27": "dot_net_intake",
    "28": "marketing_intake",
    "29": "web_intake",
    "30": "random",
    "31": "swear",
    "32": "vacation_in_com",
    "33": "salutaion",
    "34": "task",
    "35": "ragging",
    "36": "hod"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "admission_documents": 20,
    "alternance": 26,
    "canteen": 23,
    "company_ceo": 25,
    "company_events": 19,
    "company_infrastructure": 22,
    "creator": 2,
    "dot_net_intake": 27,
    "dot_net_salary": 6,
    "dot_net_skills": 5,
    "dot_net_source_control": 9,
    "dot_net_team_lead_promotion": 7,
    "dot_net_version_in_use": 8,
    "dotnet_work_hours": 4,
    "floors": 21,
    "goodbye": 1,
    "greeting": 0,
    "hod": 36,
    "location_company": 18,
    "marketing_intake": 28,
    "marketing_salary": 11,
    "marketing_skills": 10,
    "marketing_stack_version": 14,
    "marketing_team_lead_promotion": 12,
    "marketing_tools_in_use": 13,
    "name": 3,
    "placement": 24,
    "ragging": 35,
    "random": 30,
    "salutaion": 33,
    "swear": 31,
    "task": 34,
    "vacation_in_com": 32,
    "web_intake": 29,
    "web_salary": 16,
    "web_skills": 15,
    "web_team_lead_promotion": 17
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.51.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
